import React from "react";
import s from './Modal.module.css'


interface IModal {
    active: boolean
    setActive: any
    children: any
    title: string
}

export const Modal: React.FC<IModal> = ( props ) => {

    let info: string

    if ( props.title === 'Турция' ) {
        info = 'Турция, официально — Турецкая Республика — государство в Западной Азии (97 %) и в Южной Европе (3 %). Население — 83,6 млн чел., площадь территории — 783 562 км².'
    } else if ( props.title === 'Греция' ) {
        info = 'Греция, также Третья Греческая республика, официально — Греческая Республика — государство в Южной Европе. Население — 10,8 млн чел., площадь территории — 131 957 км².'
    } else if ( props.title === 'Египет' ) {
        info = 'Египет, официальное название — Арабская Республика Египет, — трансконтинентальное государство, расположенное в Северной Африке и на Ближнем Востоке (Синайский полуостров).'
    } else if ( props.title === 'Мальдивы' ) {
        info = 'Мальдивы, официальное название — Мальдивская Республика, — государство в Южной Азии, располагающееся на группе атоллов в Аравийском море Индийского океана.'
    } else if ( props.title === 'Сочи' ) {
        info = 'Сочи — город в России, расположен на северо-восточном побережье Чёрного моря (Черноморское побережье России) в Краснодарском крае, на расстоянии 1615 км от Москвы.'
    } else if ( props.title === 'Крым' ) {
        info = 'Крым, также Крымский полуостров, ранее Таврида — полуостров в северной части Чёрного моря, с северо-востока омывается Азовским морем.'
    } else if ( props.title === 'Москва' ) {
        info = 'Москва — столица России, город федерального значения, административный центр Центрального федерального округа и центр Московской области, в состав которой не входит.'
    } else if ( props.title === 'Санкт-Петербург' ) {
        info = 'Санкт-Петербург — второй по численности населения город России. Город федерального значения. Административный центр Северо-Западного федерального округа.'
    }

    return (
        <div className={ props.active ? s.ModalActive : s.Modal } onClick={ () => props.setActive( false ) }>
            <div className={ s.ModalCon } onClick={ e => e.stopPropagation() }>
                <div className={ s.ClosePanel } onClick={ () => props.setActive( false ) }>
                    <div className={ s.CloseBtn }>
                        <div/>
                        <div/>
                    </div>
                </div>
                <div className={ s.Padding }>
                    { props.children }
                    <div className={ s.Info }>
                        {/* @ts-ignore */}
                        <p>{ info }</p>
                    </div>
                </div>
            </div>
        </div>
    )
}